#!/usr/bin/env bash
set -u

###========================================================================================###
###    if statement                                                                        ###
###========================================================================================###

### macOSかどうかを判定します。
### @return macOS: 0
### @return macOS以外: 1
isMac(){
    if [ "$(uname)" == 'Darwin' ]; then
        return 0
    else
        return 1
    fi
}

###========================================================================================###
###    Utility                                                                             ###
###========================================================================================###

### コマンドが存在するかを確認します。
### @return 存在する: 0
### @return 存在しない: 1
exists() {
    type "$1" >/dev/null 2>&1
}

### ファイルをバックアップフォルダに移動します。
backup() {
    filename=$(basename $1).$(date +%s)
    mkdir -p "${dotfilesDirectory}/backup"
    mv "$1" "${dotfilesDirectory}/backup/${filename}"
    info "${1}を${filename}に移動しました。"
}

### ファイルが存在する場合は待避し、シンボリックリンクを作成します。
create_symbolic() {
    info "${1} → ${2} のシンボリックリンクを作成します。"
    if [ -e "$2" ]; then
        if [ -L "$2" ]; then
            warn "シンボリックリンクが存在します。削除します。"
            rm "$2"
        else
            backup $2
        fi
    fi
    ln -s "$1" "$2"
}

### Yes/Noを尋ねます。未指定の場合はNoになります。
### @return yes: 0
### @return no: 1
ask_yes_or_no() {
    message="Are you sure?"
    if [ $# -eq 1 ]; then
        message=$1
    fi

    printf '\033[1;37;46m%s\033[m ' "$message [y/N]:"
    read -p "" yn
    case "$yn" in [yY]*) ;; *)
        return 1
        ;;
    esac
    return 0
}

###========================================================================================###
###    Print                                                                               ###
###========================================================================================###

info() {
    printf '\033[1;32m%s\033[m\n' "$1"
}

warn() {
    printf '\033[1;33m%s\033[m\n' "$1"
}

error() {
    printf '\033[1;37;41m%s\033[m\n' "$1"
}
