jorgebucaran/fisher
oh-my-fish/theme-bobthefish
jethrokuan/z
0rax/fish-bd
decors/fish-ghq
oh-my-fish/plugin-peco
tsu-nera/fish-peco_recentd
adriaanzon/fish-artisan-completion
